Revit 2027 API
ElectricalEquipment.MaxNumberOfCircuits Property
 The maximum number of circuits for switchboard. The quantity of circuits can be assigned to switchboard through breaker.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MaxNumberOfCircuits { get; set; }
Public Property MaxNumberOfCircuits As Integer
	Get
	Set
public:
property int MaxNumberOfCircuits {
	int get ();
	void set (int value);
}
member MaxNumberOfCircuits : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input max number of circuits value is invalid for switchboard.
InvalidOperationException |  The electrical equipment is not a switchboard equipment.
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace